Ran Plan for dir: `aws` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_security_group.sg will be created
+ resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Allow all ports, just for testing"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allowing all ports"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "all-ports-tf"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "all-ports-tf"
        }
      + tags_all               = {
          + "Name" = "all-ports-tf"
        }
      + vpc_id                 = "vpc-c64808a2"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


time="2023-09-28T04:58:46Z" level=info msg="Enabled tag policies"
time="2023-09-28T04:58:46Z" level=info msg="Detected Terraform plan JSON file at /home/atlantis/.atlantis/repos/waleedahmeddev/atlantis/1/default/aws/default.json"
time="2023-09-28T04:58:46Z" level=info msg="Starting: Extracting only cost-related params from terraform"
time="2023-09-28T04:58:46Z" level=info msg="Starting: Retrieving cloud prices to calculate costs"
time="2023-09-28T04:58:46Z" level=info msg="Output saved to /tmp/waleedahmeddev-atlantis-1/default-aws-infracost.json"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://3.0.99.151:60043/lock?id=waleedahmeddev%252Fatlantis%252Faws%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d aws`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`